In [18]:
import pandas as pd

df1 = pd.DataFrame({'A' : ['A1', 'A2'], 'B' : ['B1', 'B2'], 'C' : ['C1', 'C1']})
df2 = pd.DataFrame({'C' : ['C1', 'C2', 'C1'], 'D' : ['D1', 'D2', 'D3']})

print(df1)
print(df2)

    A   B   C
0  A1  B1  C1
1  A2  B2  C1
    C   D
0  C1  D1
1  C2  D2
2  C1  D3

In [ ]:
pd.merge(df1, df2)

In [19]:
df3 = pd.DataFrame({
    'Name' : ['A', 'B', 'A', 'B', 'A', 'B', 'A', 'B'],  
    'Term' : [1, 1, 1, 1, 2, 2, 2, 2],
    'Score' : [1,10,3,20,4,30,6,40] })
df3

  Name  Term  Score
0    A     1      1
1    B     1     10
2    A     1      3
3    B     1     20
4    A     2      4
5    B     2     30
6    A     2      6
7    B     2     40

In [30]:
df3.pivot_table(index=['Name'], columns='Term')

     Score
Term     1   2
Name
A        2   5
B       15  35

In [31]:
df3.pivot_table(index=['Name', 'Term'])

           Score
Name Term
A    1         2
     2         5
B    1        15
     2        35

In [33]:
df3.groupby(['Name', 'Term']).sum()

           Score
Name Term
A    1         4
     2        10
B    1        30
     2        70

In [34]:
df3.groupby(['Name', 'Term']).count()

           Score
Name Term
A    1         2
     2         2
B    1         2
     2         2